perf/logsf.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 0
      rampTo: 1000
    - name: Plain
      duration: 60
      arrivalRate: 500
    

scenarios:
  - name: Logs (/logs)
    flow:
      - get:
          url: '/logs'