perf/put-rates.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 1000
    - name: Plain
      duration: 60
      arrivalRate: 500

scenarios:
  - name: USD to EUR
    weight: 25
    flow:
      - put:
          url: '/rates'
          headers:
            Content-Type: 'application/json'
          json:
            baseCurrency: "USD"
            counterCurrency: "EUR"
            rate: 1.08
          expect:
            - statusCode: [200, 400]

  - name: USD to ARS
    weight: 25
    flow:
      - put:
          url: '/rates'
          headers:
            Content-Type: 'application/json'
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            rate: 1000
          expect:
            - statusCode: [200, 400]

  - name: EUR to BRL  
    weight: 25
    flow:
      - put:
          url: '/rates'
          headers:
            Content-Type: 'application/json'
          json:
            baseCurrency: "EUR"
            counterCurrency: "BRL"
            rate: 6.2
          expect:
            - statusCode: [200, 400]

  - name: ARS to BRL
    weight: 25
    flow:
      - put:
          url: '/rates'
          headers:
            Content-Type: 'application/json'
          json:
            baseCurrency: "ARS"
            counterCurrency: "BRL"
            rate: 0.0036
          expect:
            - statusCode: [200, 400]